{
  "components": [
    {
      "id": 1,
      "name": "Onboard Fare Collection System",
      "description": "Composite fare collection solution combining a traditional cash farebox and the Hop Fastpass contactless smart card reader. This system allows drivers to accommodate cash-paying riders and those using reloadable smart cards or contactless bank cards:contentReference[oaicite:0]{index=0}:contentReference[oaicite:1]{index=1}. It streamlines boarding and supports fare capping across TriMet, C-TRAN, and Portland Streetcar services.",
      "is_composite": true,
      "child_components": [2, 3],
      "version": "Account-based Hop Fastpass (2017)",
      "deployment_date": "2017",
      "update_frequency": "Software configuration updates as needed via network; hardware refreshed with new bus procurements",
      "known_issues": "Initial public adoption required education, but no major technical issues reported after launch",
      "vendors": [1, 6],
      "function_name": "Fare Collection"
    },
    {
      "id": 2,
      "name": "Electronic Farebox (Cash Fare Collection)",
      "description": "A bus-mounted farebox that securely accepts coins and bills, prints transfers, and counts fares. C-TRAN replaced its 25-year-old fareboxes with this modern LECIP model in 2016:contentReference[oaicite:2]{index=2}, improving transaction speed with a deep coin hopper and modular design for easy maintenance:contentReference[oaicite:3]{index=3}. Drivers no longer punch paper transfers manually, and currency validation is nearly flawless:contentReference[oaicite:4]{index=4}.",
      "is_composite": false,
      "child_components": [],
      "version": "LECIP LF-7000 series farebox:contentReference[oaicite:5]{index=5}",
      "deployment_date": "2016 (C-TRAN), 2025 (TriMet):contentReference[oaicite:6]{index=6}",
      "update_frequency": "Rare firmware updates; 5-year maintenance cycles with periodic software support:contentReference[oaicite:7]{index=7}",
      "known_issues": "Initial installation presented challenges (new mounting brackets, user training) which were overcome through collaborative effort:contentReference[oaicite:8]{index=8}. Ongoing issues are minimal, with occasional coin jams handled via routine maintenance.",
      "vendors": [6],
      "function_name": "Fare Collection"
    },
    {
      "id": 3,
      "name": "Contactless Smart Card Validator (Hop Fastpass Reader)",
      "description": "An on-board contactless payment validator that allows riders to 'tap' Hop Fastpass cards, mobile wallets, or QR codes to pay fares. These INIT-manufactured readers (built with FEIG Electronics technology) are installed near the driver and doors:contentReference[oaicite:9]{index=9}. They provide quick (<0.5s) fare validation and support open-loop payments (contactless bank cards) and offline mode transactions:contentReference[oaicite:10]{index=10}. The driver can monitor the validator’s status via the console, though the device operates autonomously for passenger self-service.",
      "is_composite": false,
      "child_components": [],
      "version": "INIT / FEIG contactless validator",
      "deployment_date": "July 2017:contentReference[oaicite:11]{index=11}",
      "update_frequency": "Remotely updated and monitored through INIT’s management application:contentReference[oaicite:12]{index=12}; firmware/configuration updates rolled out centrally as needed",
      "known_issues": "No significant issues reported post-launch. Some riders initially forgot to tap off or needed guidance, but overall system reliability has been high",
      "vendors": [1],
      "function_name": "Fare Collection"
    },
    {
      "id": 4,
      "name": "CAD/AVL Driver Console (INIT Onboard Unit)",
      "description": "An integrated Computer-Aided Dispatch/Automatic Vehicle Location unit by INIT that provides the driver interface for route information, GPS-based tracking, on-time performance, and messaging. It includes a touchscreen/keyboard MDT for log-in, real-time navigation and emergency alarms, and interfaces with other systems like fare collection and announcements:contentReference[oaicite:13]{index=13}. C-TRAN deployed INIT’s system in 2004 and upgraded to the latest version in 2014:contentReference[oaicite:14]{index=14} (including integration with the Hop e-fare system), while TriMet similarly installed an INIT CAD/AVL and radio system in the early 2010s:contentReference[oaicite:15]{index=15}.",
      "is_composite": false,
      "child_components": [],
      "version": "INIT MOBILE-ITCS CAD/AVL (2014 release)",
      "deployment_date": "2004 initial, upgrade in 2014:contentReference[oaicite:16]{index=16}",
      "update_frequency": "Major system upgrades approximately every 10 years; incremental software patches and map updates periodically via maintenance contract",
      "known_issues": "Early-generation units became outdated, necessitating hardware refresh by 2014:contentReference[oaicite:17]{index=17}. Occasional GPS dropouts or software glitches are addressed by vendor updates; overall the system is stable with ongoing support",
      "vendors": [1],
      "function_name": "Operations (CAD/AVL)"
    },
    {
      "id": 5,
      "name": "CAD/AVL Driver Console (Trapeze Onboard System)",
      "description": "The onboard bus control unit from Trapeze Group providing CAD/AVL functionality for dispatch communication, GPS tracking, and automated passenger information. Spokane Transit (STA) deployed this intelligent vehicle system after a 2012 contract:contentReference[oaicite:18]{index=18}. It integrates with automated passenger counters and next-stop audio/visual announcements:contentReference[oaicite:19]{index=19}, enabling the driver to stay on schedule with real-time location updates and to automatically trigger stop displays and PA announcements. The driver’s MDT shows schedule adherence, two-way text messages, and emergency alert capabilities tied into dispatch.",
      "is_composite": false,
      "child_components": [],
      "version": "Trapeze TransitMaster CAD/AVL",
      "deployment_date": "2013 (system rolled out after 2012 procurement):contentReference[oaicite:20]{index=20}",
      "update_frequency": "Software updates provided via vendor support; major upgrades aligned with 5–10 year technology refresh cycles",
      "known_issues": "No major issues reported publicly. Initial training was required to familiarize drivers with the new interface. System performance improvements (e.g. fewer radio dead spots and more accurate real-time predictions) were noted post-implementation",
      "vendors": [2],
      "function_name": "Operations (CAD/AVL)"
    },
    {
      "id": 6,
      "name": "Digital Two-Way Radio Communication System",
      "description": "A trunked digital radio system (Project 25 standard) that provides voice communications between bus operators and dispatch. TriMet’s fleet, for example, uses a system supplied by Tait Communications integrated with INIT’s CAD/AVL:contentReference[oaicite:21]{index=21}. The driver has a handset and/or headset and a push-to-talk microphone, with features like one-touch emergency alarm and silent alarm functionality that alert dispatch with the vehicle’s GPS location:contentReference[oaicite:22]{index=22}. The system offers clear, encrypted voice channels and interoperable connectivity with other agencies (replacing older analog UHF radios):contentReference[oaicite:23]{index=23}, greatly improving reliability and safety.",
      "is_composite": false,
      "child_components": [],
      "version": "Tait P25 digital radio network",
      "deployment_date": "2013 (system-wide upgrade completed):contentReference[oaicite:24]{index=24}",
      "update_frequency": "Infrequent firmware updates; infrastructure and mobile units have a lifecycle of ~15+ years",
      "known_issues": "The previous analog system suffered from channel congestion and had to meet FCC narrowbanding mandates:contentReference[oaicite:25]{index=25}. The new digital system resolved those issues. Few issues have arisen aside from occasional radio hardware replacements; the encrypted network requires periodic key updates and testing",
      "vendors": [8],
      "function_name": "Communications"
    },
    {
      "id": 7,
      "name": "Electronic Destination Sign System",
      "description": "LED destination displays mounted on the front, side, and rear of the bus to inform passengers of the route number and destination. Systems from Luminator Technology Group are common; TriMet and C-TRAN buses utilize Luminator signs (upgrading from older flip-dot models to high-visibility LEDs):contentReference[oaicite:26]{index=26}. The driver can update the signs by entering a route code or it can be set automatically by the onboard computer when the operator logs in. These signs are designed to be energy-efficient and durable:contentReference[oaicite:27]{index=27}, with brightness sensors to adjust to ambient light.",
      "is_composite": false,
      "child_components": [],
      "version": "Luminator LED Destination Displays (e.g. Horizon series)",
      "deployment_date": "2000s–2010s (LED signs phased in to replace older technology)",
      "update_frequency": "Route database updated as needed (when routes or names change); hardware replaced during fleet renewal or when failures occur (typical lifespan ~12 years)",
      "known_issues": "Generally reliable. Older flip-dot signs required regular maintenance and could be hard to read in low light; modern LED units have largely resolved those issues. Occasionally, failed LED segments or driver input errors (wrong code) can display incorrect information, which maintenance or the driver can correct",
      "vendors": [7],
      "function_name": "Passenger Information"
    },
    {
      "id": 8,
      "name": "Onboard Video Surveillance System",
      "description": "A multi-camera CCTV system that records video (and often audio) on the bus for safety and security. C-TRAN, for example, equipped its fleet with Apollo Video Technology’s RoadRunner DVR and ViM (Vehicle Information Management) software in 2014:contentReference[oaicite:28]{index=28}. Each bus has a network of 8 to 12 high-definition cameras covering the interior (and sometimes forward-facing or side views) to capture about 95% of the bus’s interior and its surroundings:contentReference[oaicite:29]{index=29}. Drivers have access to a monitor showing live footage of the rear door or other critical views on some vehicles, but cannot retrieve recordings themselves. Footage is offloaded wirelessly to the central system (via Wi-Fi/cellular) for authorized staff to review. The system includes health monitoring to alert maintenance if a camera or recorder fails:contentReference[oaicite:30]{index=30}.",
      "is_composite": false,
      "child_components": [],
      "version": "Apollo Video RoadRunner DVR with ViM software",
      "deployment_date": "2014 (full fleet retrofit completed):contentReference[oaicite:31]{index=31}",
      "update_frequency": "Software/firmware updates occasionally to improve video quality or storage efficiency; storage drives replaced periodically. System design allows forward-compatible upgrades to extend service life:contentReference[oaicite:32]{index=32}",
      "known_issues": "Prior to upgrade, older DVRs had limited coverage and slow video retrieval, leading to delays in incident response. The new system improved reliability and drastically reduced the time to locate and download footage:contentReference[oaicite:33]{index=33}. Remaining issues are minor, such as the need to clean camera lenses and manage data storage, which are handled through regular maintenance",
      "vendors": [3],
      "function_name": "Safety & Security"
    },
    {
      "id": 9,
      "name": "Collision Avoidance Driver Assistance System",
      "description": "An active safety system (often the Mobileye Shield+ by Rosco Vision Systems) that warns bus operators of pedestrians, cyclists, or vehicles in blind spots or when a forward collision risk is detected:contentReference[oaicite:34]{index=34}. It uses multiple vision sensors/cameras mounted around the bus and displays with audible/visual alerts in the driver’s cabin. For example, C-TRAN equipped seven buses with the Mobileye Shield+ system as part of a statewide pilot in late 2015:contentReference[oaicite:35]{index=35}. If a person is in the bus’s path or a vehicle suddenly brakes ahead, the system alerts the driver with flashing icons (indicating location: left, center, or right) and alarm sounds, giving up to 3 seconds of warning:contentReference[oaicite:36]{index=36}. It also notifies the driver about following too closely and speeding over the limit:contentReference[oaicite:37]{index=37}.",
      "is_composite": false,
      "child_components": [],
      "version": "Mobileye Shield+ (Transit Pedestrian Collision Warning)",
      "deployment_date": "2015 (initial pilot deployment):contentReference[oaicite:38]{index=38}",
      "update_frequency": "Installed as an aftermarket kit; calibration updates or software enhancements applied occasionally. Generally maintained during regular vehicle servicing",
      "known_issues": "No significant technical failures reported during pilots. Some transit agencies have noted that false alerts or over-sensitivity can cause \"alarm fatigue\" for drivers if not calibrated well, so proper configuration and training are crucial. Overall, drivers in test programs gave positive feedback on the system’s effectiveness:contentReference[oaicite:39]{index=39}",
      "vendors": [4, 5],
      "function_name": "Safety & Security"
    },
    {
      "id": 10,
      "name": "Eco-Driving Driver Assistance (Efficiency Coaching)",
      "description": "An in-cab driver assistance tool that provides real-time feedback for efficient driving, particularly on hybrid or electric buses. C-TRAN is deploying the INIT/CarMedialab MOBILEefficiency system, which analyzes driving behavior and battery usage on its new electric fleet:contentReference[oaicite:40]{index=40}. The system gives the operator instantaneous coaching (e.g. encouraging smoother acceleration, optimal coasting, and regenerative braking techniques) via a small display or console integration. By guiding drivers to more energy-efficient driving styles, it reduces energy consumption and can improve passenger comfort with smoother rides:contentReference[oaicite:41]{index=41}.",
      "is_composite": false,
      "child_components": [],
      "version": "INIT MOBILEefficiency (CarMedialab)",
      "deployment_date": "2024",
      "update_frequency": "Software-based system updated periodically as algorithms improve; data from operations is uploaded for analysis to further refine coaching tips. Feedback parameters can be adjusted without hardware changes",
      "known_issues": "As a newer technology, its effectiveness depends on driver buy-in. Agencies must provide training so operators trust and appropriately respond to the coaching. No technical problems have been reported; any issues tend to be related to adjusting alert sensitivity to find the right balance between efficiency and maintaining schedules",
      "vendors": [1],
      "function_name": "Driver Assistance"
    }
  ],
  "vendors": [
    {
      "id": 1,
      "name": "INIT Innovations in Transportation, Inc.",
      "website": "https://www.initusa.com",
      "vendor_email": null,
      "vendor_phone": "757-413-9100",
      "contact_name": null,
      "contact_email": null,
      "contact_phone": "757-413-9100",
      "description": "Leading provider of integrated ITS solutions including CAD/AVL, real-time passenger information, fare collection systems, and electric bus management solutions globally."
    },
    {
      "id": 2,
      "name": "Trapeze Group (Volaris)",
      "website": "https://www.trapezegroup.com/",
      "vendor_email": "info@trapezegroup.com",
      "vendor_phone": "319-743-1000",
      "contact_name": null,
      "contact_email": "info@trapezegroup.com",
      "contact_phone": "319-743-1000",
      "description": "Provider of transit management software including CAD/AVL, passenger information, scheduling, and mobility management solutions."
    },
    {
      "id": 3,
      "name": "Apollo Video Technology (Luminator Transit Division)",
      "website": "https://www.apollovideotechnology.com/",
      "vendor_email": null,
      "vendor_phone": "425-483-7100",
      "contact_name": null,
      "contact_email": null,
      "contact_phone": "425-483-7100",
      "description": "Specializes in mobile video surveillance systems for transit, known for RoadRunner DVR and ViM software, enhancing security and fleet management."
    },
    {
      "id": 4,
      "name": "Rosco Vision Systems",
      "website": "https://www.roscovision.com/",
      "vendor_email": null,
      "vendor_phone": "800-227-2095",
      "contact_name": null,
      "contact_email": null,
      "contact_phone": "800-227-2095",
      "description": "Manufacturer of automotive vision safety products, including camera-based collision avoidance and pedestrian safety systems for buses."
    },
    {
      "id": 5,
      "name": "Mobileye (Intel Company)",
      "website": "https://www.mobileye.com/",
      "vendor_email": "contact@mobileye.com",
      "vendor_phone": null,
      "contact_name": null,
      "contact_email": "contact@mobileye.com",
      "contact_phone": null,
      "description": "Global leader in advanced driver-assistance systems, particularly camera and AI-based collision avoidance technologies."
    },
    {
      "id": 6,
      "name": "LECIP Inc.",
      "website": "https://www.lecipinc.com/",
      "vendor_email": "sales@lecipinc.com",
      "vendor_phone": "312-626-2525",
      "contact_name": "Tony Torrence",
      "contact_email": "sales@lecipinc.com",
      "contact_phone": "847-217-5470",
      "description": "LECIP Inc. is the U.S. subsidiary of LECIP Holdings Corporation, providing automated fare collection systems, LED lighting, and passenger information systems."
    },
    {
      "id": 7,
      "name": "Luminator Technology Group",
      "website": "https://www.luminator.com/",
      "vendor_email": null,
      "vendor_phone": "972-424-6511",
      "contact_name": null,
      "contact_email": null,
      "contact_phone": "972-424-6511",
      "description": "Manufacturer of destination signage, infotainment screens, and passenger communication systems for transit vehicles."
    },
    {
      "id": 8,
      "name": "Tait Communications",
      "website": "https://www.taitcommunications.com/",
      "vendor_email": null,
      "vendor_phone": "281-829-3300",
      "contact_name": null,
      "contact_email": null,
      "contact_phone": "281-829-3300",
      "description": "Provider of mission-critical digital radio communication solutions tailored for public safety and transportation."
    },
    {
      "id": 9,
      "name": "New Flyer Industries (NFI Group)",
      "website": "https://www.newflyer.com/",
      "vendor_email": "Melissa_Schnee@newflyer.com",
      "vendor_phone": "385-910-6861",
      "contact_name": "Melissa Schnee",
      "contact_email": "Melissa_Schnee@newflyer.com",
      "contact_phone": "385-910-6861",
      "description": "North America's largest transit bus manufacturer offering battery-electric and fuel cell-electric mobility solutions."
    },
    {
      "id": 10,
      "name": "Gillig Corporation",
      "website": "https://www.gillig.com/",
      "vendor_email": "cramirez@gillig.com",
      "vendor_phone": "510-264-5000",
      "contact_name": "Christine Ramirez",
      "contact_email": "cramirez@gillig.com",
      "contact_phone": "510-264-5061",
      "description": "Second-largest transit bus provider in North America offering heavy-duty battery electric, hybrid, and clean diesel buses."
    },
    {
      "id": 11,
      "name": "BYD/RIDE Mobility",
      "website": "https://en.byd.com/",
      "vendor_email": "socialmediaglobal@byd.com",
      "vendor_phone": "213-245-6503",
      "contact_name": "Bryan Morales",
      "contact_email": "socialmediaglobal@byd.com",
      "contact_phone": "213-245-6503",
      "description": "Global pioneer in electric bus manufacturing specializing in battery and zero-emission vehicle technologies."
    },
    {
      "id": 12,
      "name": "Right Systems! Inc",
      "website": "https://www.rightsys.com/",
      "vendor_email": "info@rightsys.com",
      "vendor_phone": "800-571-1717",
      "contact_name": null,
      "contact_email": "info@rightsys.com",
      "contact_phone": "800-571-1717",
      "description": "Provider of IT solutions and consulting services, specializing in infrastructure, networking, cybersecurity, and managed services."
    },
    {
      "id": 13,
      "name": "IQGeo",
      "website": "https://www.iqgeo.com",
      "vendor_email": "info@iqgeo.com",
      "vendor_phone": "+44 1223 606655",
      "contact_name": null,
      "contact_email": "info@iqgeo.com",
      "contact_phone": "+44 1223 606655",
      "description": "Provider of geospatial software solutions designed for managing network assets and optimizing field operations for utilities and telecom companies."
    }
  ]
}