{
  "standards": [
    {
      "name": "General Transit Feed Specification (GTFS)",
      "version": "1.0",
      "description": "The most widely used open data standard for sharing fixed-route transit schedules, stops, and fare information with the public and trip planning apps. GTFS extensions cover real-time updates (GTFS-RT), pathways, fares, flexible services, and operational data.",
      "standard_url": "https://gtfs.org/"
    },
    {
      "name": "GTFS-Realtime (GTFS-RT)",
      "version": "2.0",
      "description": "Extension of GTFS that provides real-time updates including vehicle positions, trip updates, and service alerts.",
      "standard_url": "https://gtfs.org/realtime/"
    },
    {
      "name": "GTFS-Flex",
      "version": "v2-draft",
      "description": "An extension of GTFS designed to support flexible and demand-responsive transit services, such as paratransit and microtransit, enabling agencies to communicate non-fixed route service details.",
      "standard_url": "https://github.com/MobilityData/gtfs-flex"
    },
    {
      "name": "Service Interface for Real Time Information (SIRI)",
      "version": "2.0",
      "description": "A modular standard for real-time information exchange, covering vehicle locations, schedules, and service messages between control centers, agencies, and public-facing systems.",
      "standard_url": "https://www.transmodel-cen.eu/standards/siri/"
    },
    {
      "name": "Transit Communications Interface Profiles (TCIP)",
      "version": "3.0d",
      "description": "A comprehensive standard for data exchange among transit business systems, subsystems, and devices, including scheduling, passenger information, incident management, and fare collection.",
      "standard_url": "https://www.apta.com/research-technical-resources/standards/tcip/"
    },
    {
      "name": "Mobility Data Specification (MDS)",
      "version": "2.0",
      "description": "Facilitates secure communication of trip, vehicle, and service data between mobility providers (e.g., microtransit, scooters) and city agencies, supporting regulatory and operational needs.",
      "standard_url": "https://github.com/openmobilityfoundation/mobility-data-specification"
    },
    {
      "name": "Transactional Data Specification (TDS)",
      "version": "1.0",
      "description": "Focuses on structuring scheduling and booking data for demand-responsive transit (DRT) and paratransit services, enabling interoperability for trip requests, confirmations, and status updates.",
      "standard_url": "https://github.com/cal-itp/tds-spec"
    },
    {
      "name": "Transport Operator to Mobility as a Service Provider (TOMP) API",
      "version": "1.2.0",
      "description": "An open standard for technical communication between transport operators and Mobility as a Service (MaaS) providers, supporting integrated trip planning, booking, and payment.",
      "standard_url": "https://tomp-wg.org/"
    },
    {
      "name": "Transit Operational Data Standard (TODS)",
      "version": "0.9",
      "description": "Extends GTFS to include operational details such as deadhead time and other behind-the-scenes data useful for transit operators.",
      "standard_url": "https://github.com/MobilityData/TODS"
    },
    {
      "name": "Transit ITS Data Exchange Specification (TIDES)",
      "version": "draft",
      "description": "Standardizes access to archived and historical ITS data, including vehicle location, passenger counts, and fare transactions, supporting analysis and reporting.",
      "standard_url": "https://trid.trb.org/view/2019/M/1630387"
    },
    {
      "name": "Curb Data Specification (CDS)",
      "version": "1.0",
      "description": "Communicates curb-use regulations and management data between cities and mobility providers to enable better curb access and policy enforcement.",
      "standard_url": "https://curbspec.org/"
    },
    {
      "name": "CurbLR",
      "version": "1.0",
      "description": "A lightweight curb regulation format designed to work with CDS and open data tools, enabling digital curb rule publishing and use by cities and third parties.",
      "standard_url": "https://github.com/curblr/curblr"
    }
  ]
}
